Repository: yvs2014/iputils99
Catalog: po/*.po
Languages: uk

source: Usage
uk: Застосування

source: Options
uk: Параметри

source: options
uk: параметри

source: TARGET
uk: ЦІЛЬ

source: HOST
uk: ВУЗОЛ

source: For more details see
uk: Докладніший опис можна знайти в

source: No goal
uk: Нема мети

source: -f quit on first reply -q be quiet -b keep on broadcasting, do not unicast -D duplicate address detection mode -U unsolicited ARP mode, update your neighbours -A ARP answer mode, update your neighbours -V print version and exit -c <count> how many packets to send -w <timeout> how long to wait for a reply -i <interval> set interval between packets (default: 1 second) -I <device> which ethernet device to use -s <source> source IP address
uk: -f вийти при першій відповіді -q не виводити даних -b продовжувати пінгування всієї підмережі, та не переходити до направленої адресації -D режим виявлення дублікатів адрес -U незапитуваний режим ARP, оновити ваше оточення -A режим відповідей ARP, оновити ваше оточення -V вивести версію і завершити роботу -c <к-ть> кількість пакетів, які слід надіслати -w <час> час очікування на відповідь -i <інтервал> інтервал між пакетами (типове значення: 1 секунда) -I <пристрій> пристрій ethernet, яким слід скористатися -s <джерело> IP адреса джерела

source: without -o, use icmp timestamp only (see RFC792, page 16) -o use IP timestamp and icmp echo -o1 use three-term IP timestamp and icmp echo -T, --time-format <ctime|iso> specify display time format, ctime is the default -I alias of --time-format=iso -h, --help display this help -V, --version print version and exit
uk: без -o використовується лише часова позначка icmp (див. RFC792 стор.16) -o використовувати часову позначку IP та icmp ехо -o1 використовувати трикомпонентний час IP та icmp ехо -T, --time-format <ctime|iso> вказати формат показу часу, типовим є ctime -I те саме, що --time-format=iso -h, --help показати цю довідкову інформацію -V вивести версію і завершити роботу

source: -a use audible ping -A use adaptive ping -B sticky source address -c <count> stop after <count> replies -C call connect() syscall on socket creation -D print timestamps -d use SO_DEBUG socket option -e <identifier> define identifier for ping session, default is random for SOCK_RAW and kernel defined for SOCK_DGRAM Imply using SOCK_RAW (for IPv4 only for identifier 0) -f flood ping -h print help and exit -H force reverse DNS name resolution (useful for numeric destinations or for -f), override -n -I <interface> either interface name or address -i <interval> seconds between sending each packet -L suppress loopback of multicast packets -l <preload> send <preload> number of packages while waiting replies -m <mark> tag the packets going out -M <pmtud opt> define path MTU discovery, can be one of <do|dont|want|probe> -n no reverse DNS name resolution, override -H -O report outstanding replies -p <pattern> contents of padding byte -q quiet output -Q <tclass> use quality of service <tclass> bits -s <size> use <size> as number of data bytes to be sent -S <size> use <size> as SO_SNDBUF socket option value -t <ttl> define time to live -U print user-to-user latency -v verbose output -V print version and exit -w <deadline> reply wait <deadline> in seconds -W <timeout> time to wait for response IPv4 options: -4 use IPv4 -b allow pinging broadcast -R record route -T <timestamp> define timestamp, can be one of <tsonly|tsandaddr|tsprespec> IPv6 options: -6 use IPv6 -F <flowlabel> define flow label, default is random -N <nodeinfo opt> use IPv6 node info query, try <help> as argument
uk: -a використовувати звуковий супровід -A адаптивне зондування -B липка початкова адреса -c <число> надіслати задану кількість ICMP запитів -C скористатися викликом connect() при створенні сокета -D виводити часові позначки -d встановити SO_DEBUG параметр сокета -e <число> визначити ідентифікатор ICMP пакетів, типовим є випадковий для SOCK_RAW і визначається ядром для SOCK_DGRAM -f надсилати пакети якнайшвидше, тобто флуд -h вивести довідку і завершити роботу -H примусово запитувати назви IP адрес, має пріоритет вищий за -n -I <інтерфейс> назва або адреса інтерфейсу -i <число> інтервал між надсиланням пакетів (у секундах) -L не використовувати петльовий інтерфейс для групової розсилки -l <число> надсилати задану кількість пакетів під час очікування на відповідь -m <позначка> позначка для вихідних пакетів -M <режим> визначити MTU режим, одне зі значень <do|dont|want|probe> -n не запитувати назви IP адрес -O звітувати нестандартні відповіді -p <зразок> зразок для заповнення вихідних пакетів -q скорочене виведення -Q <байт> встановити QoS значення: TOS (IPv4) чи TClass (IPv6) -s <розмір> встановити <розмір> даних які надсилатимуся -S <розмір> використовувати <розмір> як значення сокет параметра SO_SNDBUF -t <число> визначити максимальне значення TTL, зазвичай це кількість переходів до пункту призначення -U виводити програмну затримку замість мережевої -v докладне виведення -V вивести версію і завершити роботу -w <строк> крайній термін очікування на відповідь (у секундах) -W <час> час очікування на відповідь (у секундах) Параметри IPv4: -4 використовувати IPv4 -b дозволити пінгування всієї підмережі -R запис маршруту -T <позначка> визначити часову позначку, одне зі значень <tsonly|tsandaddr|tsprespec> Параметри IPv6: -6 використовувати IPv6 -F <відмітка> визначити відмітку потоку, типова - випадкова -N <параметр> задати параметр NodeInfo (подивіться -N help)

source: -4 use IPv4 -6 use IPv6 -b print both name and IP -l <length> use packet <length> -m <hops> use maximum <hops> -n no reverse DNS name resolution -p <port> use destination <port> -v verbose output -V print version and exit
uk: -4 використовувати IPv4 -6 використовувати IPv6 -b виводити назву та адресу -l <довжина> довжина пакетів у байтах -m <переходів> максимальна кількість переходів -n не використовувати DNS -p <порт> використовувати <порт> призначення -v докладне виведення -V вивести версію і завершити роботу

source: -4 IPv4 family -6 IPv6 family -f value ai_flags decimal or hex value use -f multiple times to combine flags -F macro ai_flags macro like AI_IDN use -F multiple times to combine flags -i convert IDN names using libidn2 (available if IDN is not transparently supported) -h print help and exit -v verbose output -V print version and exit
uk: -4 сімейство адрес IPv4 -6 сімейство адрес IPv6 -f число ai_flags значення (десяткове або шістнадцяткове) використовуйте -f декілька разів для об'єднання аргументів -F макро ai_flags макро (на зразок AI_IDN) використовуйте -F декілька разів для об'єднання аргументів -i конвертувати IDN назви за допомогою libidn2 (опція доступна, якщо IDN не підтримується прозоро) -h вивести довідку і завершити роботу -v докладне виведення -V вивести версію і завершити роботу

source: no need in -i, IDN is transparently supported
uk: опція -i не потрібна, IDN підтримується прозоро

source: Sent probes
uk: Надіслано запитів

source: Received responses
uk: Отримано відповідей

source: request
uk: запит

source: broadcast
uk: на всю підмережу

source: Unicast
uk: Направлена адресація

source: Broadcast
uk: Розсилка на підмережу

source: reply
uk: відповідь

source: for
uk: для

source: UNSOLICITED
uk: НЕБАЖАНИЙ

source: Interface is down
uk: Інтерфейс вимкнений

source: Interface is not ARPable
uk: Інтерфейс непридатний для ARP

source: Using default broadcast address
uk: Використовуємо типову адресу всієї підмережі

source: Interface is ignored
uk: Iнтерфейс проігноровано

source: no ll address
uk: немає link-level адреси

source: ARPING
uk: ARP пінг

source: From
uk: З

source: from
uk: з

source: No source address in not-DAD mode
uk: Немає адреси джерела у режимі без DAD

source: Wrong timestamp
uk: Помилкова часова позначка

source: Overflow hops
uk: Перевищено кількість переходів

source: measure
uk: вимірювання

source: Unknown failure
uk: Невідома помилка

source: Non-standard time format
uk: Нестандартний формат часу

source: host
uk: вузол

source: rtt
uk: затримка

source: delta
uk: різниця

source: ms
uk: мсек

source: Qtype conflict
uk: Конфлікт Qtype

source: Subject type conflict
uk: Конфлікти типів теми

source: IDN encoding error
uk: Помилка кодування IDN

source: Too long scope name
uk: Надто довга назва зони

source: Inappropriate subject name
uk: Неприйнятна назва теми

source: dn_comp() returned too long result
uk: dn_comp() повернуто надто довгий результат

source: Scope discrepancy among the nodes
uk: Невідповідність зон між вузлами

source: Source address might be selected on other device
uk: Вихідну адресу можливо вибрано на іншому пристрої

source: Minimal user interval for multicast ping must be >=
uk: Мінімальний інтервал користувача для групової розсилки має бути >=

source: Minimal user interval for broadcast ping must be >=
uk: Мінімальний інтервал користувача для пінгування всієї підмережі має бути >=

source: see -i option for details
uk: дивіться подробиці опції -i

source: Multicast ping
uk: Пінг групової розсилки

source: Broadcast ping
uk: Пінг всієї підмережі не фрагментується

source: does not fragment
uk: не фрагментується

source: PING
uk: ПІНГ

source: flow
uk: потік

source: Destination unreachable
uk: Пункт призначення недоступний

source: No route
uk: Немає маршруту

source: Administratively prohibited
uk: Адміністративно заборонено

source: Beyond scope of source address
uk: Поза зоною адреси джерела

source: Address unreachable
uk: Недосяжна адреса

source: Port unreachable
uk: Недосяжний порт

source: Source address failed ingress/egress policy
uk: Адреса джерела не відповідає вхідним-вихідним правилам

source: Reject route to destination
uk: Відкинути маршрут до призначення

source: Packet too big
uk: Занадто великий пакет

source: Time exceeded
uk: Перевищено час

source: Hop limit
uk: Обмеження на кількість переходів

source: Defragmentation failure
uk: Помилка під час дефрагментації

source: code
uk: код

source: Parameter problem
uk: Проблема з параметром

source: Wrong header field
uk: Помилкове поле заголовка

source: Unknown header
uk: Невідомий заголовок

source: Unknown option
uk: Невідомий параметр

source: info
uk: інфо

source: Echo request
uk: Луна-запит

source: Echo reply
uk: Луна-відповідь

source: MLD Query
uk: Запит MLD

source: MLD Report
uk: Звіт MLD

source: MLD Reduction
uk: Спрощення MLD

source: Unknown icmp type
uk: Невідомий тип icmp

source: Local error
uk: Локальна помилка

source: Message too long
uk: Завелике повідомлення

source: parse error
uk: помилка обробки

source: too short
uk: замало

source: truncated
uk: обрізано

source: unexpected error
uk: неочікувана помилка

source: unknown qtype
uk: невідомий qtype

source: refused
uk: відмовлено

source: unknown
uk: невідомий

source: unknown code
uk: невідомий код

source: Packet too short
uk: Занадто короткий пакет

source: minimal
uk: мінімум

source: WARNING
uk: УВАГА

source: => missing capability
uk: => відсутність властивості

source: Bad value for flowinfo
uk: Неправильне значення flowinfo

source: Flow value is greater than 20 bits
uk: Значення потоку перевищує 20 біт

source: Bad TOS value
uk: Неправильне значення TOS

source: Decimal value of TOS bits must be in range 0-255
uk: Значення TOS має бути в діапазоні 0-255

source: Invalid timestamp type
uk: Некоректний тип часової позначки

source: Bad timing interval
uk: Помилковий інтервал часу

source: Cannot copy
uk: Неможливо скопіювати

source: Invalid source address
uk: Некоректна адреса джерела

source: Invalid source
uk: Некоректне джерело

source: Cannot set preload to value greater than 3
uk: Неможливо встановити розмір пре-завантаження більш за 3

source: Bad linger time
uk: Помилковий час затягування

source: ident 0 => forcing raw socket
uk: ident 0 => примусово raw сокет

source: Only 'tsprespec' is allowed with intermediate hops
uk: З транзитом дозволено тільки 'tsprespec'

source: Too many intermediate TS hops
uk: Надто багато проміжних TS адрес

source: Too many intermediate hops
uk: Надто багато проміжних адрес

source: max
uk: макс

source: NodeInfo client is for IPv6 only
uk: Клієнт NodeInfo тільки для IPv6

source: Cannot set NodeInfo option
uk: Неможливо встановити параметр для NodeInfo

source: NodeInfo packet can only have a header
uk: Пакет NodeInfo може мати лише заголовок

source: Do you want to ping broadcast? Then -b. If not, check your local firewall rules
uk: Хочете надіслати пінг на всю підмережу? Скористайтеся -b. Якщо ні, перевірте, чи правильно вказано правила вашого локального файрвола

source: Pinging broadcast address
uk: Пінгування всієї підмережі

source: Cannot set broadcasting
uk: Не вдалося встановити пінгування всієї підмережі

source: Cannot disable multicast loopback
uk: Неможливо вимкнути петльовий інтерфейс групової розсилки

source: data bytes
uk: байт даних

source: (same route)
uk: (такий самий маршрут)

source: absolute not-standard
uk: нестандартне абсолютне значення

source: not-standard
uk: нестандартне значення

source: absolute
uk: абсолютне значення

source: Unrecorded hops
uk: Незаписаних переходів

source: Echo Reply
uk: Луна-відповідь

source: Destination Net Unreachable
uk: Мережа призначення недоступна

source: Destination Host Unreachable
uk: Вузол призначення недоступний

source: Destination Protocol Unreachable
uk: Протокол призначення недоступний

source: Destination Port Unreachable
uk: Порт призначення недоступний

source: Frag needed and DF set
uk: Потрібна фрагментація і встановлено DF

source: Source Route Failed
uk: Помилка маршрутизації залежної від джерела

source: Destination Net Unknown
uk: Невідома мережа призначення

source: Destination Host Unknown
uk: Невідомий вузол призначення

source: Source Host Isolated
uk: Ізольований вузол джерела

source: Destination Net Prohibited
uk: Заборонена мережа призначення

source: Destination Host Prohibited
uk: Заборонений вузол призначення

source: Destination Net Unreachable for Type of Service
uk: Мережа недоступна для ToS пакетів

source: Destination Host Unreachable for Type of Service
uk: Пункт призначення недоступний для ToS пакетів

source: Packet filtered
uk: Пакет відфільтровано

source: Precedence Violation
uk: Порушення першості

source: Precedence Cutoff
uk: Обрізання першості

source: Dest Unreachable
uk: Недоступний пункт призначення

source: Bad Code
uk: Хибний код

source: Source Quench
uk: Обрив зв'язку з джерелом

source: Redirect Network
uk: Мережева переадресація

source: Redirect Host
uk: Переадресація вузла

source: Redirect Type of Service and Network
uk: Мережева переадресація служби ToS

source: Redirect Type of Service and Host
uk: Переадресація вузла і служби ToS

source: Redirect
uk: Переадресація

source: New nexthop
uk: Новий наступний шлюз

source: Echo Request
uk: Луна-запит

source: Time to live exceeded
uk: Перевищено TTL

source: Frag reassembly time exceeded
uk: Перевищено час перезбирання фрагментів

source: Timestamp
uk: Часова позначка

source: Timestamp Reply
uk: Відповідь з часовою позначкою

source: Information Request
uk: Інформаційний запит

source: Information Reply
uk: Інформаційна відповідь

source: Address Mask Request
uk: Запит маски адреси

source: Address Mask Reply
uk: Відповідь з маскою адреси

source: Bad ICMP type
uk: Неправильний тип ICMP

source: Pattern must be specified as hex digits
uk: Взірець слід вказувати шістнадцятковими цифрами

source: Blank pattern
uk: Порожній взірець

source: PATTERN
uk: ВЗІРЕЦЬ

source: PAYLOAD
uk: НАВАНТАЖЕННЯ

source: No answer yet
uk: Відповіді ще немає

source: Probably, rcvbuf is not enough to hold preload
uk: Ймовірно, rcvbuf замалий для попереднього завантаження

source: failed to set mark
uk: не вдалося встановити позначку

source: SO_MARK not supported
uk: SO_MARK не підтримується

source: Cannot flood
uk: Флуд неможливий

source: Minimal user interval must be >=
uk: Мінімальний інтервал для користувача має бути >=

source: Illegal preload and/or interval
uk: Некоректне пре-завантаження і/або інтервал

source: no SO_TIMESTAMP support, falling back to SIOCGSTAMP
uk: немає підтримки SO_TIMESTAMP, використовуємо SIOCGSTAMP

source: Time runs backwards
uk: Відставання часу

source: byte
uk: байт

source: icmp_seq
uk: номер

source: ident
uk: ідент

source: ttl
uk: ттл

source: DUP
uk: ДУБЛЬ

source: BAD CHECKSUM
uk: НЕПРАВИЛЬНА КОНТРОЛЬНА СУМА

source: DIFFERENT ADDRESS
uk: ІНША АДРЕСА

source: wrong byte #
uk: помилковий байт #

source: expected 0x
uk: очікувалось 0x

source: got 0x
uk: отримано 0x

source: ping statistics
uk: пінг статистика

source: packet transmitted
uk: пакет надіслано

source: received
uk: отримано

source: duplicates
uk: дублікатів

source: corrupted
uk: пошкоджено

source: errors
uk: помилок

source: lost
uk: втрачено

source: unidentified
uk: не розпізнано

source: probably
uk: ймовірно

source: hop away
uk: перехід

source: time
uk: час

source: rtt min/avg/max/mdev
uk: затримка мін/сер/макс/відх

source: pipe
uk: конвеєр

source: in-flight
uk: в процесі

source: packets
uk: пакетів

source: min/avg/ewma/max
uk: мін/сер/EWMA/макс

source: non-filtered out
uk: не відфільтровано

source: No info
uk: Немає інформації

source: LOCALHOST
uk: ЛОКАЛЬНИЙ-КОМП

source: (corrupted payload)
uk: (пошкоджені дані)

source: reached
uk: досягнуто

source: asymm
uk: асим

source: NET ERROR
uk: ПОМИЛКА МЕРЕЖІ

source: reply received
uk: отримано у відповідь

source: send failed
uk: помилка надсилання

source: Mutually exclusive options
uk: Взаємовиключні опції

source: no reply
uk: немає відповіді

source: Resume
uk: Висновок

source: Too many hops
uk: Надто багато переходів

source: hops
uk: переходів

source: back
uk: назад

source: Packet length
uk: Довжина пакета
